app/controllers/docs_controller.rb

SELECT  "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def find_doc
      @doc=Doc.find(params[:id])