app/controllers/pics_controller.rb

def index
    @pics =Pic.all
---
SELECT "pics".* FROM "pics"

  def create
    @pic = Pic.new(doc_params)

    if @pic.save
---
INSERT INTO "pics" ("title", "domain", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["domain", ""], ["content", ""], ["created_at", "2018-03-21 04:07:34.827946"], ["updated_at", "2018-03-21 04:07:34.827946"]]

  def destroy
     @pic.destroy
---
DELETE FROM "pics" WHERE "pics"."id" = ?  [["id", 1]]

    def find_doc
      @pic=Pic.find(params[:id])
---
SELECT  "pics".* FROM "pics" WHERE "pics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]